{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "dimensional-ministry",
   "metadata": {},
   "source": [
    "Задача 1. Напишите программу с классом Student, в котором есть три атрибута: name, groupNumber и age. По умолчанию name = Ivan, age = 18, groupNumber = 10A. Необходимо создать пять методов: getName, getAge, getGroupNumber, setNameAge, setGroupNumber. Метод getName нужен для получения данных об имени конкретного студента, метод getAge нужен для получения данных о возрасте конкретного студента, vетод setGroupNumberнужен для получения данных о номере группы конкретного студента. Метод SetNameAge позволяет изменить данные атрибутов установленных по умолчанию, метод setGroupNumber позволяет изменить номер группы установленный по умолчанию. В программе необходимо создать пять экземпляров класса Student, установить им разные имена, возраст и номер группы.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "59124dc5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Имя и возраст изменены\n",
      "Номер группы изменен\n",
      "Имя и возраст изменены\n",
      "Номер группы изменен\n",
      "Имя и возраст изменены\n",
      "Номер группы изменен\n",
      "Имя и возраст изменены\n",
      "Номер группы изменен\n",
      "Имя и возраст изменены\n",
      "Номер группы изменен\n",
      "\n",
      "Тут 19 7A\n",
      "написаны 20 8A\n",
      "какие 21 9A\n",
      "то 22 10A\n",
      "имена 23 11A\n"
     ]
    }
   ],
   "source": [
    "class Student:\n",
    "    def __init__(self, name='Ivan', age=18, groupNumber='10A'):\n",
    "        self.name = name\n",
    "        self.age = age\n",
    "        self.groupNumber = groupNumber\n",
    "        \n",
    "    def getName(self):\n",
    "        return self.name\n",
    "    def getAge(self):\n",
    "        return self.age\n",
    "    def getGroupNumber(self):\n",
    "        return self.groupNumber\n",
    "    def setNameAge(self,name,age):\n",
    "        self.name = name\n",
    "        self.age = age\n",
    "        print('Имя и возраст изменены')\n",
    "    def setGroupNumber(self, groupNumber):\n",
    "        self.groupNumber = groupNumber\n",
    "        print('Номер группы изменен')\n",
    "        \n",
    "        \n",
    "        \n",
    "a = Student()\n",
    "a.setNameAge(\"Тут\",19)\n",
    "a.setGroupNumber(\"7A\")\n",
    "b = Student()\n",
    "b.setNameAge(\"написаны\",20)\n",
    "b.setGroupNumber(\"8A\")\n",
    "c = Student()\n",
    "c.setNameAge(\"какие\",21)\n",
    "c.setGroupNumber(\"9A\")\n",
    "d = Student()\n",
    "d.setNameAge(\"то\",22)\n",
    "d.setGroupNumber(\"10A\")\n",
    "e = Student()\n",
    "e.setNameAge(\"имена\",23)\n",
    "e.setGroupNumber(\"11A\")\n",
    "\n",
    "print(f'\\n{a.getName()} {a.getAge()} {a.getGroupNumber()}')\n",
    "print(f'{b.getName()} {b.getAge()} {b.getGroupNumber()}')\n",
    "print(f'{c.getName()} {c.getAge()} {c.getGroupNumber()}')\n",
    "print(f'{d.getName()} {d.getAge()} {d.getGroupNumber()}')\n",
    "print(f'{e.getName()} {e.getAge()} {e.getGroupNumber()}')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "quality-positive",
   "metadata": {},
   "source": [
    "Задача 2. Напишите программу с классом Car. Создайте конструктор класса Car. Создайте атрибуты класса Car — color (цвет), type (тип), year (год). Напишите пять методов. Первый — запуск автомобиля, при его вызове выводится сообщение «Автомобиль заведен». Второй — отключение автомобиля — выводит сообщение «Автомобиль заглушен». Третий — присвоение автомобилю года выпуска. Четвертый метод — присвоение автомобилю типа. Пятый — присвоение автомобилю цвета.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "04a821f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Автомобиль заведён\n",
      "Автомобиль заглушен\n"
     ]
    }
   ],
   "source": [
    "class Car:\n",
    "    def __init__(self, color='unknown', typeCar='unknown', year=0):\n",
    "        self.color = color\n",
    "        self.typeCar = typeCar\n",
    "        self.year = year\n",
    "        \n",
    "    def startEngine(self):\n",
    "        print('Автомобиль заведён')\n",
    "    def stopEngine(self):\n",
    "        print('Автомобиль заглушен')\n",
    "    def setYear(self, year):\n",
    "        self.year = year\n",
    "    def setTypeCar(self,typeCar):\n",
    "        self.typeCar = typeCar\n",
    "    def setColor(self, color):\n",
    "        self.color = color\n",
    "        \n",
    "a = Car()\n",
    "a.setColor(\"Черный\")\n",
    "a.setTypeCar('седан')\n",
    "a.setYear(2014)\n",
    "a.startEngine()\n",
    "a.stopEngine()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3112079e",
   "metadata": {},
   "outputs": [],
   "source": [
    "Nutrition"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "f8795266",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nutrition p 2, c 4, f 6\n",
      "313\n",
      "315\n",
      "Nutrition p 0, c 75, f 0\n"
     ]
    }
   ],
   "source": [
    "class NutritionInfo:\n",
    "    def __init__(self, proteins, carbs, fats):\n",
    "        self.proteins = proteins\n",
    "        self.carbs = carbs\n",
    "        self.fats = fats\n",
    "    \n",
    "    def __add__(self, other):\n",
    "        return NutritionInfo(self.proteins + other.proteins, self.carbs + other.carbs, self.fats + other.fats)\n",
    "    \n",
    "    def __str__(self):\n",
    "        return f\"Nutrition p {self.proteins}, c {self.carbs}, f {self.fats}\"\n",
    "        \n",
    "    def energy(self):\n",
    "        return int(self.fats * 9 + (self.carbs + self.proteins) * 4.2)\n",
    "    def __mul__(self, other):\n",
    "        return  NutritionInfo(self.proteins * other, self.carbs * other, self.fats * other)\n",
    "    \n",
    "egg = NutritionInfo(1, 2, 3)\n",
    "pastila = NutritionInfo(1, 2, 3)\n",
    "tvorog_9 = NutritionInfo(18, 3, 9)\n",
    "apple = NutritionInfo(0, 25, 0)\n",
    "\n",
    "print(egg + pastila)\n",
    "\n",
    "breakfast = apple + tvorog_9 + pastila\n",
    "print(breakfast.energy())\n",
    "\n",
    "breakfast = apple * 3\n",
    "print(breakfast.energy())\n",
    "print(apple*3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d65cb5ed",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
